Revit 2027 API
EnergyDataSettings.CheckExportComplexity Method
 Checks that the export complexity falls within an appropriate range.
Namespace: Autodesk.Revit.DB.Analysis
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static bool CheckExportComplexity(
	gbXMLExportComplexity exportComplexity
)
Public Shared Function CheckExportComplexity (
	exportComplexity As gbXMLExportComplexity
) As Boolean
public:
static bool CheckExportComplexity(
	gbXMLExportComplexity exportComplexity
)
static member CheckExportComplexity :
        exportComplexity : gbXMLExportComplexity -> bool
Parameters
exportComplexity gbXMLExportComplexity
 The export complexity to be checked.
Return Value
Boolean
 True if the export complexity falls within an appropriate range, false otherwise.
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  A value passed for an enumeration argument is not a member of that enumeration
See Also
Reference
EnergyDataSettings Class
Autodesk.Revit.DB.Analysis Namespace